{
  "categories": [
    {
      "id": "1",
      "name": "การนำองค์การ",
      "description": "หมวดนี้เกี่ยวข้องกับการนำองค์การโดยผู้บริหารระดับสูง รวมถึงการกำกับดูแลองค์การและความรับผิดชอบต่อสังคม",
      "subcategories": [
        {
          "id": "1.1",
          "name": "การนำองค์การโดยผู้บริหารของส่วนราชการ",
          "description": "การดำเนินการของผู้บริหารในการชี้นำและทำให้ส่วนราชการยั่งยืน",
          "category_id": "1",
          "criteria": [
            {
              "id": "1.1.1",
              "name": "วิสัยทัศน์ ค่านิยม",
              "description": "ผู้บริหารของส่วนราชการดำเนินการกำหนดวิสัยทัศน์และค่านิยม",
              "subcategory_id": "1.1"
            },
            {
              "id": "1.1.2",
              "name": "การส่งเสริมการประพฤติปฏิบัติตามหลักนิติธรรม ความโปร่งใส",
              "description": "ผู้บริหารของส่วนราชการแสดงความมุ่งมั่นต่อการประพฤติตามหลักนิติธรรม ความโปร่งใส และความมีจริยธรรม",
              "subcategory_id": "1.1"
            },
            {
              "id": "1.1.3",
              "name": "การสร้างส่วนราชการที่ยั่งยืน",
              "description": "ผู้บริหารของส่วนราชการสร้างสภาพแวดล้อมเพื่อทำให้ส่วนราชการบรรลุพันธกิจ และความสำเร็จในระยะยาว",
              "subcategory_id": "1.1"
            }
          ]
        },
        {
          "id": "1.2",
          "name": "การกำกับดูแลองค์การและความรับผิดชอบต่อสังคม",
          "description": "การกำกับดูแลส่วนราชการและการประพฤติปฏิบัติตามกฎหมาย และจริยธรรม",
          "category_id": "1",
          "criteria": [
            {
              "id": "1.2.1",
              "name": "การกำกับดูแลองค์การ",
              "description": "ส่วนราชการดำเนินการกำกับดูแลองค์การอย่างมีความรับผิดชอบ",
              "subcategory_id": "1.2"
            },
            {
              "id": "1.2.2",
              "name": "การประพฤติปฏิบัติตามกฎหมายและอย่างมีจริยธรรม",
              "description": "ส่วนราชการดำเนินการด้านกฎหมาย กฎระเบียบ และการประพฤติปฏิบัติอย่างมีจริยธรรม",
              "subcategory_id": "1.2"
            },
            {
              "id": "1.2.3",
              "name": "การสร้างประโยชน์ให้สังคม",
              "description": "ส่วนราชการคำนึงถึงประโยชน์ของสังคมเป็นส่วนหนึ่งในกลยุทธ์และการปฏิบัติการประจำวัน",
              "subcategory_id": "1.2"
            }
          ]
        }
      ]
    },
    {
      "id": "2",
      "name": "การวางแผนเชิงยุทธศาสตร์",
      "description": "หมวดนี้เกี่ยวข้องกับการจัดทำยุทธศาสตร์ วัตถุประสงค์เชิงยุทธศาสตร์ และการนำไปปฏิบัติ",
      "subcategories": [
        {
          "id": "2.1",
          "name": "การจัดทำยุทธศาสตร์",
          "description": "การจัดทำยุทธศาสตร์และวัตถุประสงค์เชิงยุทธศาสตร์ของส่วนราชการ",
          "category_id": "2",
          "criteria": [
            {
              "id": "2.1.1",
              "name": "กระบวนการจัดทำยุทธศาสตร์",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการจัดทำยุทธศาสตร์",
              "subcategory_id": "2.1"
            },
            {
              "id": "2.1.2",
              "name": "วัตถุประสงค์เชิงยุทธศาสตร์",
              "description": "วัตถุประสงค์เชิงยุทธศาสตร์ที่สำคัญของส่วนราชการมีอะไรบ้าง",
              "subcategory_id": "2.1"
            }
          ]
        },
        {
          "id": "2.2",
          "name": "การนำยุทธศาสตร์ไปปฏิบัติ",
          "description": "การแปลงวัตถุประสงค์เชิงยุทธศาสตร์ไปสู่แผนปฏิบัติการ",
          "category_id": "2",
          "criteria": [
            {
              "id": "2.2.1",
              "name": "การจัดทำแผนปฏิบัติการและการถ่ายทอดสู่การปฏิบัติ",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการจัดทำแผนปฏิบัติการและการถ่ายทอดแผนไปสู่การปฏิบัติ",
              "subcategory_id": "2.2"
            },
            {
              "id": "2.2.2",
              "name": "การคาดการณ์ผลการดำเนินการ",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการคาดการณ์ผลการดำเนินการ",
              "subcategory_id": "2.2"
            }
          ]
        }
      ]
    },
    {
      "id": "3",
      "name": "การให้ความสำคัญกับผู้รับบริการและผู้มีส่วนได้ส่วนเสีย",
      "description": "หมวดนี้เกี่ยวข้องกับการรับฟังผู้รับบริการและผู้มีส่วนได้ส่วนเสีย และการสร้างความผูกพัน",
      "subcategories": [
        {
          "id": "3.1",
          "name": "สารสนเทศผู้รับบริการและผู้มีส่วนได้ส่วนเสีย",
          "description": "การรับฟังเสียงของผู้รับบริการและผู้มีส่วนได้ส่วนเสีย",
          "category_id": "3",
          "criteria": [
            {
              "id": "3.1.1",
              "name": "การรับฟังผู้รับบริการและผู้มีส่วนได้ส่วนเสีย",
              "description": "ส่วนราชการมีวิธีการรับฟังเสียงของผู้รับบริการและผู้มีส่วนได้ส่วนเสียอย่างไร",
              "subcategory_id": "3.1"
            },
            {
              "id": "3.1.2",
              "name": "การประเมินความพึงพอใจและความผูกพัน",
              "description": "ส่วนราชการมีวิธีการประเมินความพึงพอใจและความผูกพันของผู้รับบริการและผู้มีส่วนได้ส่วนเสียอย่างไร",
              "subcategory_id": "3.1"
            }
          ]
        },
        {
          "id": "3.2",
          "name": "การสร้างความผูกพัน",
          "description": "การสร้างความสัมพันธ์กับผู้รับบริการและผู้มีส่วนได้ส่วนเสีย",
          "category_id": "3",
          "criteria": [
            {
              "id": "3.2.1",
              "name": "การพัฒนาและการจัดการผลผลิตและบริการ",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการพัฒนาและจัดการผลผลิตและบริการ",
              "subcategory_id": "3.2"
            },
            {
              "id": "3.2.2",
              "name": "การสร้างความสัมพันธ์กับผู้รับบริการและผู้มีส่วนได้ส่วนเสีย",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการสร้างและจัดการความสัมพันธ์กับผู้รับบริการและผู้มีส่วนได้ส่วนเสีย",
              "subcategory_id": "3.2"
            }
          ]
        }
      ]
    },
    {
      "id": "4",
      "name": "การวัด การวิเคราะห์ และการจัดการความรู้",
      "description": "หมวดนี้เกี่ยวข้องกับการวัด วิเคราะห์ และการปรับปรุงผลการดำเนินการ และการจัดการสารสนเทศและความรู้",
      "subcategories": [
        {
          "id": "4.1",
          "name": "การวัด วิเคราะห์ และปรับปรุงผลการดำเนินการของส่วนราชการ",
          "description": "การวัด วิเคราะห์ ทบทวน และปรับปรุงผลการดำเนินการขององค์การ",
          "category_id": "4",
          "criteria": [
            {
              "id": "4.1.1",
              "name": "การวัดผลการดำเนินการ",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการวัดผลการดำเนินการ",
              "subcategory_id": "4.1"
            },
            {
              "id": "4.1.2",
              "name": "การวิเคราะห์และทบทวนผลการดำเนินการ",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการวิเคราะห์และทบทวนผลการดำเนินการ",
              "subcategory_id": "4.1"
            },
            {
              "id": "4.1.3",
              "name": "การปรับปรุงผลการดำเนินการ",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการปรับปรุงผลการดำเนินการ",
              "subcategory_id": "4.1"
            }
          ]
        },
        {
          "id": "4.2",
          "name": "การจัดการสารสนเทศและการจัดการความรู้",
          "description": "การจัดการสารสนเทศ ระบบสารสนเทศ และการจัดการความรู้",
          "category_id": "4",
          "criteria": [
            {
              "id": "4.2.1",
              "name": "การจัดการข้อมูลและสารสนเทศ",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการจัดการข้อมูลและสารสนเทศ",
              "subcategory_id": "4.2"
            },
            {
              "id": "4.2.2",
              "name": "การจัดการความรู้",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการจัดการความรู้",
              "subcategory_id": "4.2"
            }
          ]
        }
      ]
    },
    {
      "id": "5",
      "name": "การมุ่งเน้นบุคลากร",
      "description": "หมวดนี้เกี่ยวข้องกับการบริหารขีดความสามารถและอัตรากำลังของบุคลากร และการสร้างความผูกพัน",
      "subcategories": [
        {
          "id": "5.1",
          "name": "สภาพแวดล้อมด้านบุคลากร",
          "description": "การบริหารขีดความสามารถและอัตรากำลังของบุคลากรให้ทำงานให้บรรลุผล",
          "category_id": "5",
          "criteria": [
            {
              "id": "5.1.1",
              "name": "การบริหารขีดความสามารถและอัตรากำลัง",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการบริหารขีดความสามารถและอัตรากำลังของบุคลากร",
              "subcategory_id": "5.1"
            },
            {
              "id": "5.1.2",
              "name": "บรรยากาศการทำงานของบุคลากร",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการสร้างบรรยากาศการทำงานที่เอื้อต่อผลการดำเนินการที่ดี",
              "subcategory_id": "5.1"
            }
          ]
        },
        {
          "id": "5.2",
          "name": "ความผูกพันของบุคลากร",
          "description": "การสร้างความผูกพันของบุคลากรเพื่อให้เกิดสภาพแวดล้อมการทำงานที่ดี",
          "category_id": "5",
          "criteria": [
            {
              "id": "5.2.1",
              "name": "การประเมินความผูกพันของบุคลากร",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการประเมินความผูกพันของบุคลากร",
              "subcategory_id": "5.2"
            },
            {
              "id": "5.2.2",
              "name": "วัฒนธรรมองค์การ",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการเสริมสร้างวัฒนธรรมองค์การที่มีบุคลากรที่มีผลการดำเนินการที่ดี",
              "subcategory_id": "5.2"
            },
            {
              "id": "5.2.3",
              "name": "การบริหารผลการปฏิบัติงานและการพัฒนา",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการบริหารผลการปฏิบัติงานและการพัฒนาบุคลากร",
              "subcategory_id": "5.2"
            }
          ]
        }
      ]
    },
    {
      "id": "6",
      "name": "การมุ่งเน้นระบบปฏิบัติการ",
      "description": "หมวดนี้เกี่ยวข้องกับการออกแบบและการจัดการกระบวนการทำงานที่สำคัญ",
      "subcategories": [
        {
          "id": "6.1",
          "name": "กระบวนการทำงาน",
          "description": "การออกแบบ จัดการ และปรับปรุงผลผลิต บริการ และกระบวนการทำงานที่สำคัญ",
          "category_id": "6",
          "criteria": [
            {
              "id": "6.1.1",
              "name": "การออกแบบผลผลิต การบริการ และกระบวนการทำงาน",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการออกแบบผลผลิต การบริการ และกระบวนการทำงานที่สำคัญ",
              "subcategory_id": "6.1"
            },
            {
              "id": "6.1.2",
              "name": "การจัดการกระบวนการทำงาน",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการนำกระบวนการทำงานที่สำคัญไปปฏิบัติ",
              "subcategory_id": "6.1"
            },
            {
              "id": "6.1.3",
              "name": "การปรับปรุงผลผลิต การบริการ และกระบวนการทำงาน",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการปรับปรุงกระบวนการทำงาน",
              "subcategory_id": "6.1"
            }
          ]
        },
        {
          "id": "6.2",
          "name": "ประสิทธิผลการปฏิบัติการ",
          "description": "การควบคุมต้นทุน การจัดการห่วงโซ่อุปทาน และการเตรียมพร้อมด้านความปลอดภัยและต่อภาวะฉุกเฉิน",
          "category_id": "6",
          "criteria": [
            {
              "id": "6.2.1",
              "name": "การควบคุมต้นทุน",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการควบคุมต้นทุนโดยรวมของปฏิบัติการ",
              "subcategory_id": "6.2"
            },
            {
              "id": "6.2.2",
              "name": "การจัดการห่วงโซ่อุปทาน",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการจัดการห่วงโซ่อุปทาน",
              "subcategory_id": "6.2"
            },
            {
              "id": "6.2.3",
              "name": "การเตรียมพร้อมด้านความปลอดภัยและต่อภาวะฉุกเฉิน",
              "description": "ส่วนราชการมีวิธีการอย่างไรในการเตรียมความพร้อมปฏิบัติการในภาวะฉุกเฉิน",
              "subcategory_id": "6.2"
            }
          ]
        }
      ]
    },
    {
      "id": "7",
      "name": "ผลลัพธ์การดำเนินการ",
      "description": "หมวดนี้เกี่ยวข้องกับการรายงานผลลัพธ์การดำเนินการในด้านต่างๆ ขององค์การ",
      "subcategories": [
        {
          "id": "7.1",
          "name": "ผลลัพธ์ด้านประสิทธิผลและการบรรลุพันธกิจ",
          "description": "ผลลัพธ์ของตัวชี้วัดหรือตัวบ่งชี้ที่สำคัญของการบรรลุพันธกิจ",
          "category_id": "7",
          "criteria": []
        },
        {
          "id": "7.2",
          "name": "ผลลัพธ์ด้านการให้ความสำคัญผู้รับบริการและผู้มีส่วนได้ส่วนเสีย",
          "description": "ผลลัพธ์ของตัวชี้วัดหรือตัวบ่งชี้ที่สำคัญของการให้ความสำคัญและการสร้างความสัมพันธ์กับผู้รับบริการและผู้มีส่วนได้ส่วนเสีย",
          "category_id": "7",
          "criteria": []
        },
        {
          "id": "7.3",
          "name": "ผลลัพธ์ด้านการมุ่งเน้นบุคลากร",
          "description": "ผลลัพธ์ของตัวชี้วัดหรือตัวบ่งชี้ที่สำคัญของการมุ่งเน้นบุคลากร",
          "category_id": "7",
          "criteria": []
        },
        {
          "id": "7.4",
          "name": "ผลลัพธ์ด้านการนำองค์การและการกำกับดูแล",
          "description": "ผลลัพธ์ของตัวชี้วัดหรือตัวบ่งชี้ที่สำคัญของการนำองค์การและการกำกับดูแล",
          "category_id": "7",
          "criteria": []
        },
        {
          "id": "7.5",
          "name": "ผลลัพธ์ด้านงบประมาณ การเงิน และการเติบโต",
          "description": "ผลลัพธ์ของตัวชี้วัดหรือตัวบ่งชี้ที่สำคัญของงบประมาณ การเงิน และการเติบโต",
          "category_id": "7",
          "criteria": []
        },
        {
          "id": "7.6",
          "name": "ผลลัพธ์ด้านประสิทธิผลของกระบวนการและการจัดการห่วงโซ่อุปทาน",
          "description": "ผลลัพธ์ของตัวชี้วัดหรือตัวบ่งชี้ที่สำคัญของประสิทธิผลของกระบวนการปฏิบัติการและห่วงโซ่อุปทาน",
          "category_id": "7",
          "criteria": []
        }
      ]
    }
  ]
}
